ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0g511x/TIMG0_1.0.xml
        <register id="TIMG0_CPSV" width="32" offset="0x10" description="Clock prescale count status register">
            <bitfield id="CPSVAL" description="Current Prescale Count Value" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG0_CTTRIGCTL" width="32" offset="0x14" description="Timer Cross Trigger Control Register">
            <bitfield id="CTEN" description="Timer Cross trigger enable. This field is used to enable whether the SW or HW logic can generate a timer cross trigger event in the system.
These cross triggers are connected to the respective timer trigger in of the other timer IPs in the SOC power domain.

The timer cross trigger is essentially the combined logic of the HW and SW conditions controlling EN bit in the CTRCTL register." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Cross trigger generation disabled."/>
                <bitenum id="ENABLE" value="0x1" description="Cross trigger generation enabled"/>
            </bitfield>
            <bitfield id="EVTCTEN" description="Enable the Input Trigger Conditions to the Timer module as a condition for Cross Triggers." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Cross trigger generation disabled."/>
                <bitenum id="ENABLE" value="0x1" description="Cross trigger generation enabled"/>
            </bitfield>
            <bitfield id="EVTCTTRIGSEL" description="Used to Select the subscriber port that should be used for input cross trigger." begin="19" end="16" width="4" rwaccess="R/W">
                <bitenum id="FSUB0" value="0x0" description="Use FSUB0 as cross trigger source."/>
                <bitenum id="FSUB1" value="0x1" description="Use FSUB1 as cross trigger source."/>
                <bitenum id="Z" value="0x2" description="Use Zero event  as cross trigger source."/>
                <bitenum id="L" value="0x3" description="Use Load event as cross trigger source."/>
                <bitenum id="CCD0" value="0x4" description="Use CCD0 event  as cross trigger source."/>
                <bitenum id="CCD1" value="0x5" description="Use CCD1 event  as cross trigger source."/>
                <bitenum id="CCD2" value="0x6" description="Use CCD2 event  as cross trigger source."/>
                <bitenum id="CCD3" value="0x7" description="Use CCD3 event  as cross trigger source."/>
                <bitenum id="CCU0" value="0x8" description="Use CCU0 event  as cross trigger source."/>
                <bitenum id="CCU1" value="0x9" description="Use CCU1 event  as cross trigger source."/>
                <bitenum id="CCU2" value="0xA" description="Use CCU2 event  as cross trigger source."/>
                <bitenum id="CCU3" value="0xB" description="Use CCU3 event  as cross trigger source."/>
            </bitfield>
        </register>
        <register id="TIMG0_CTTRIG" width="32" offset="0x1C" description="Timer Cross Trigger Register">
            <bitfield id="TRIG" description="Generate Cross Trigger
This bit when programmed will generate a synchronized trigger condition all the cross trigger enabled Timer instances including current timer instance." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Cross trigger generation disabled"/>
                <bitenum id="GENERATE" value="0x1" description="Generate Cross trigger pulse"/>
            </bitfield>
        </register>
        </group>
    <group id="TIMG0_COUNTERREGS" name="TIMG0_COUNTERREGS" instances="1" offset="0x1800" instaddr="0x100" description="">
        <register id="TIMG0_CTR" width="32" offset="0x0" description="Counter Register">
            <bitfield id="CCTR" description="Current Counter value" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG0_CTRCTL" width="32" offset="0x4" description="Counter Control Register">
            <bitfield id="EN" description="Counter Enable.  This bit allows the timer to advance  This bit is automatically cleared if REPEAT=0 (do not automatically reload) and the counter value equals zero.  CPU Write: A register write that sets the EN bit, the counter value is set per the CVAE value. Hardware: This bit may also be set as the result of an LCOND or ZCOND condition being met and the counter value changed to the load value or zero value, respectively." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Disabled"/>
                <bitenum id="ENABLED" value="0x1" description="Enabled"/>
            </bitfield>
            <bitfield id="REPEAT" description="Repeat.  The repeat bit controls whether the counter continues to advance following a zero event, or the exiting of a debug or fault condition.  If counting down, a zero event is followed by a load at the next advance condition. If counting up-down, a zero event is followed by an advance event (+1). The intent of encoding 3 is that if the debug condition is in effect, the generation of the load pulse is deferred until the debug condition is over. This allows the counter to reach zero before counting is suspended." begin="3" end="1" width="3" rwaccess="R/W">
                <bitenum id="REPEAT_0" value="0x0" description="Does not automatically advance following a zero event."/>
                <bitenum id="REPEAT_1" value="0x1" description="Continues to advance following a zero event."/>
                <bitenum id="REPEAT_2" value="0x2" description="Reserved"/>
                <bitenum id="REPEAT_3" value="0x3" description="Continues to advance following a zero event if the debug mode is not in effect, or following the release of the debug mode."/>
                <bitenum id="REPEAT_4" value="0x4" description="Reserved"/>
            </bitfield>
            <bitfield id="CM" description="Count Mode" begin="5" end="4" width="2" rwaccess="R/W">
                <bitenum id="DOWN" value="0x0" description="Down"/>
                <bitenum id="UP_DOWN" value="0x1" description="Up/Down"/>
                <bitenum id="UP" value="0x2" description="Counter counts up."/>
            </bitfield>
            <bitfield id="CVAE" description="Counter Value After Enable.  This field specifies the initialization condition of the counter when the EN bit is changed from 0 to 1 by a write to the CTRCTL register. Note that an external event can also cause the EN bit to go active." begin="29" end="28" width="2" rwaccess="R/W">
                <bitenum id="LDVAL" value="0x0" description="The counter is set to the LOAD register value"/>
                <bitenum id="NOCHANGE" value="0x1" description="The counter value is unchanged from its current value which could have been initialized by software"/>
                <bitenum id="ZEROVAL" value="0x2" description="The counter is set to zero"/>
            </bitfield>
            <bitfield id="DRB" description="Debug Resume Behavior This bit specifies what the device does following the release/exit of debug mode." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="RESUME" value="0x0" description="Resume counting"/>
                <bitenum id="CVAE_ACTION" value="0x1" description="Perform the action as specified by the CVAE field."/>
            </bitfield>
            <bitfield id="CLC" description="Counter Load Control.  This field specifies what controls the counter operation with respect to setting the counter to the LD register value. 

Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved." begin="9" end="7" width="3" rwaccess="R/W">
                <bitenum id="CCCTL0_LCOND" value="0x0" description="CCCTL_0 LCOND"/>
                <bitenum id="CCCTL1_LCOND" value="0x1" description="CCCTL_1 LCOND"/>
                <bitenum id="CCCTL2_LCOND" value="0x2" description="CCCTL_2 LCOND This value exists when there are 4 channels."/>
                <bitenum id="CCCTL3_LCOND" value="0x3" description="CCCTL_3 LCOND This value exists when there are 4 channels."/>
                <bitenum id="QEI_2INP" value="0x4" description="Controlled by 2 input QEI mode. This value exists when TIMER support QEI feature."/>
                <bitenum id="QEI_3INP" value="0x5" description="Controlled by 3 input QEI mode.  This value exists when TIMER support QEI feature."/>
            </bitfield>
            <bitfield id="CAC" description="Counter Advance Control.  This field specifies what controls the counter operation with respect to advancing (incrementing or decrementing) the counter value.  
Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved." begin="12" end="10" width="3" rwaccess="R/W">
                <bitenum id="CCCTL0_ACOND" value="0x0" description="CCCTL_0 ACOND"/>
                <bitenum id="CCCTL1_ACOND" value="0x1" description="CCCTL_1 ACOND"/>
                <bitenum id="CCCTL2_ACOND" value="0x2" description="CCCTL_2 ACOND This value exists when there are 4 channels."/>
                <bitenum id="CCCTL3_ACOND" value="0x3" description="CCCTL_3 ACOND This value exists when there are 4 channels."/>
                <bitenum id="QEI_2INP" value="0x4" description="Controlled by 2-input QEI mode  This value exists when TIMER support QEI feature."/>
                <bitenum id="QEI_3INP" value="0x5" description="Controlled by 3-input QEI mode  This value exists when TIMER support QEI feature."/>
            </bitfield>
            <bitfield id="CZC" description="Counter Zero Control This field specifies what controls the counter operation with respect to zeroing the counter value.  

Encodings 1-3 are present based on the CCPC
parameter value. Bits 4-5 are present based on
the HQEI parameter value. Any encodings not
provided are documented as reserved." begin="15" end="13" width="3" rwaccess="R/W">
                <bitenum id="CCCTL0_ZCOND" value="0x0" description="CCCTL_0 ZCOND"/>
                <bitenum id="CCCTL1_ZCOND" value="0x1" description="CCCTL_1 ZCOND"/>
                <bitenum id="CCCTL2_ZCOND" value="0x2" description="CCCTL_2 ZCOND This value exists when there are 4 channels."/>
                <bitenum id="CCCTL3_ZCOND" value="0x3" description="CCCTL_3 ZCOND This value exists when there are 4 channels."/>
                <bitenum id="QEI_2INP" value="0x4" description="Controlled by 2-input QEI mode  This value exists when TIMER support QEI feature."/>
                <bitenum id="QEI_3INP" value="0x5" description="Controlled by 3-input QEI mode  This value exists when TIMER support QEI feature."/>
            </bitfield>
        </register>
